app/controllers/movies_controller.rb

SELECT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')
---
  def set_ratings
    ratings = Movie.select(:rating).map(&:rating).uniq.sort
    ratings.each {|rating| @ratings[rating] = true}

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "movies" SET "release_date" = '2001-04-08 00:00:00.000000', "updated_at" = '2013-08-02 04:08:21.421875' WHERE "movies"."id" = 16
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])